using System;
using System.Collections.Generic;
using System.Text;

namespace rowad.Model
{
    class QuizMod
    {
        public int number { get; set; }
        public string Question { get; set; }
        public List<QuizMod> GetQuizMods()
        {
            List<QuizMod> QuizMods = new List<QuizMod>()
            {
                new QuizMod(){number=0 ,Question="أعلم أنني يجب أن أختارموضوعًا تعليميًّا أو مهنة، ولكن ليست لدي الدافعية (أي لست متحمساً للقيام بذلك في الوقت الحاضر)."},
                new QuizMod(){number=1 ,Question="لا أظن أن العمل هو أهم شيء في الحياة، ولذلك فإن مسألة اختيار المهنة لا تشغل بالي بشكل خاص."},
                new QuizMod(){number=2 ,Question="أعتقد أني الآن لست بحاجة  إلى اختيار مهنة، لأن الوقت كفيل بأن يقودني إلى المهنة الملائمة."},
                new QuizMod(){number=3 ,Question="أستصعب عادةً باتخاذ القرارات."},
                new QuizMod(){number=4 ,Question="أشعر عادةً بالحاجة إلى أخذ موافقة على قراراتي من شخص مختص أو من شخص آخر أثق به."},
                new QuizMod(){number=5 ,Question="أخاف عادةً من الفشل."},
                new QuizMod(){number=6 ,Question="أحب عادةً أن أقوم بالأشياء بطريقتي الخاصة."},
                new QuizMod(){number=7 ,Question="أتوقّع من المهنة التي سأختارها أن تحلّ أيضًا مشكلاتي الشخصية."},
                new QuizMod(){number=8 ,Question="أعتقد أنه توجد مهنة واحدة فقط تلائمني أو مجال تعليمي واحد يلائمني."},
                new QuizMod(){number=9 ,Question="أتوقع أن أحقق جميع طموحاتي من خلال المهنة التي سوف أختارها."},
                new QuizMod(){number=10 ,Question="أعتقد أن قرار اختيار مهنة أو مجال تعليمي هو قرار يُتّخذ مرة واحدة في الحياة ويلزم الإنسان مدى الحياة."},
                new QuizMod(){number=11 ,Question="أفعل دائمًا ما يمليه علي الآخرون حتى لو كان ذلك ضد إرادتي ورغباتي."},
                new QuizMod(){number=12 ,Question="يصعب علي اختيار مهنة أو مجال تعليمي لأني لا أعرف الخطوات التي يجب علي اتباعها من أجل اتخاذ هذا القرار. "},
                new QuizMod(){number=13 ,Question="يصعب علي اختيار مهنة أو مجال تعليمي لأنني لا أعرف ما هي المعطيات التي يجب مراعاتها من أجل اتخاذ هذا القرار."},
                new QuizMod(){number=14 ,Question="يصعب علي اختيار مهنة أو مجال تعليمي لأنني لا أعرف كيف ألائم بين المعلومات التي أعرفها عن نفسي والمعلومات التي أعرفها عن المهن المختلفة."},
                new QuizMod(){number=15 ,Question="يصعب علي اختيار مهنة أو مجال تعليمي لأنه تنقصني معلومات عن قدراتي أو صفاتي الشخصية (مثلاً: قدرتي في المجال التقني، المثابرة في العمل، الصبر والتحمل)."},
                new QuizMod(){number=16 ,Question="يصعب علي اختيار مهنة لأنني لم أستطع حتى الآن تحديد أي مهنة من المهن تثير اهتمامي أو تجذبني."},
                new QuizMod(){number=17 ,Question="يصعب علي اختيار مهنة لأنه ليس واضحًا لي بشكل كاف ما هي المهن التي أفضّلها (مثلًا: لم أستطع أن أحدّد ما هي المجالات تثير اهتمامي؛ ما هو شكل العلاقة التي أريدها مع الآخرين؛ ما هي شروط العمل التي أرغب فيها، وما إلى ذلك)."},
                new QuizMod(){number=18 ,Question="يصعب علي اختيار مهنة أو مجال تعليمي لأنني لا أعلم ماذا ستكون قدراتي وصفاتي الشخصية في المستقبل."},
                new QuizMod(){number=19 ,Question="يصعب علي اختيار مهنة أو مجال تعليمي لأنه تنقصني معلومات حول مميزات المهن المختلفة أو مسارات التأهيل المختلفة (مثلًا: ما هي درجة الإقبال في السوق على المهن التي أميل إليها؛ ما هي شروط القبول لمجالات التعليم التي تثير اهتمامي)."},
                new QuizMod(){number=20 ,Question="يصعب علي اختيار مهنة أو مجال تعليمي لأنه تنقصني معلومات عن المهن المختلفة أو مسارات التأهيل الموجودة (أي ما هي الإمكانيات المتوفّرة)."},
                new QuizMod(){number=21 ,Question="يصعب علي اختيار مهنة أو مجال تعليمي لأنني لا أعرف كيف سيكون وضع المهن مستقبلًا (مثلاً: ما هي متطلبات سوق العمل)"},
                new QuizMod(){number=22 ,Question="يصعب علي اختيار مهنة أو مجال تعليمي لأنني لا أعرف كيف ومن أين يمكنني الحصول على المعلومات التي تنقصني عن نفسي (قدراتي، صفاتي وميولي)."},
                new QuizMod(){number=23 ,Question="يصعب علي اختيار مهنة لأنني لا أعرف كيف وأين أحصل على معلومات دقيقة وحديثة عن المهن والمواضيع المختلفة أو مسارات التأهيل المتوفرة ومميزاتها."},
                new QuizMod(){number=24 ,Question="يصعب علي اختيار مهنة أو مجال تعليمي لأنه يوجد لدي معلومات متناقضة عن قدراتي أو صفاتي الشخصية (مثلًا: أعتقد أني شخص صبور في تعاملي مع الناس، ولكن الآخرين يدّعون بأني غير صبور)."},
                new QuizMod(){number=25 ,Question="يصعب علي اختيار مهنة أو مجال تعليمي لأنني دائمًا أغير رأيي فيما يتعلّق بالمهن التي تجذبني، أو فيما يتعلّق بالمميزات التي تهمّني في المهنة (مثلًا: أريد أحيانًا أن أكون مستقلًّا في مهنتي وأريد أحيانًا أن أكون موظفًا)."},
                new QuizMod(){number=26 ,Question="يصعب علي اختيار مهنة لأنه يوجد لدي معلومات متناقضة عن وجود هذه المهنة أو عن مميزاتها (مثلًا، هناك من يقول إنه يمكن الحصول على لقب أكاديمي معترف به في مجال معين من جميع الكليات وهناك من ينفي ذلك)."},
                new QuizMod(){number=27 ,Question="يصعب علي اختيار مهنة لأنني أميل بنفس الدرجة إلى عدة مهن، مما يجعلني محتارًا بينها."},
                new QuizMod(){number=28 ,Question="يصعب علي اختيار مهنة أو مجال تعليمي لأن المهنة التي أميل إليها يوجد فيها ميزة معينة لا تعجبني (مثلاً، أرغب في مهنة الطب لكن لا أريد أن أقضي سنوات كثيرة في التعليم)."},
                new QuizMod(){number=29 ,Question="يصعب علي اختيار مهنة أو مجال تعليمي لأن الأمور التي أفضلها لا يمكن أن تتوفر جميعها في مهنة واحدة، وأنا لست مستعدًا/مستعدة أن أتنازل عن أي منها (مثلاً، أنا أريد أن أعمل بشكل مستقل لكن أريد أن يكون لي دخل ثابت)."},
                new QuizMod(){number=30 ,Question="يصعب علي اختيار مهنة أو مجال تعليمي لأن قدراتي ومهاراتي لا تلائم مستوى ومتطلبات المهنة التي أرغب فيها."},
                new QuizMod(){number=31 ,Question="يصعب علي اختيار مهنة أو مجال تعليمي لأن جميع المهن والمجالات التعليمية التي يمكن قبولي فيها لا تعجبني."},
                new QuizMod(){number=32 ,Question="يصعب علي اختيار مهنة أو مجال تعليمي، لأن المهنة التي أرغب فيها أو الاعتبارات التي أريد أخذها بالحسبان غير مقبولة لدى الأشخاص المهمّين بالنسبة لي (مثلاً: لدي اهتمامات بالمجال الفني، ولكن أبي وأمي يريدان أن أتعلم مجالاً تقنيًّا)."},
                new QuizMod(){number=33 ,Question="يصعب علي اختيار مهنة أو مجال تعليمي لأنه يوجد تناقض بين نصائح الأشخاص المهمين بالنسبة لي فيما يتعلق بالمهنة الملائمة لي، أو فيما يتعلق بمميزات هذه المهنة. (مثلا: أبي وأمي ينصحاني بأن أدرس وأحصل على لقب أكاديمي، بينما ينصحني أصدقائي بأن أتعلم مهنة لا تحتاج إلى أكثر من سنة دراسية واحدة)."}
            };
            return QuizMods;
        }
    }
}
